In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')
engine.connect()

In [3]:
query = """Select count(*) from green_taxi_trips
where lpep_pickup_datetime::date='2019-01-15';"""

pd.read_sql(query, con=engine)

   count
0  20689

In [4]:
query = """
select date_trunc('day', lpep_pickup_datetime) as pickup_date,
max(trip_distance) as max_trip_distance
from green_taxi_trips
group by 1
order by max_trip_distance desc
limit 1;"""

pd.read_sql(query, con=engine)

  pickup_date  max_trip_distance
0  2019-01-15             117.99

In [5]:
query = """
select passenger_count,
count(*) as trip_counts

from green_taxi_trips

where passenger_count in (2,3)
and lpep_pickup_datetime::date='2019-01-01'

group by passenger_count;
"""

pd.read_sql(query, con=engine)

   passenger_count  trip_counts
0                2         1282
1                3          254

In [6]:
query = """
select puzones.zone as pickup_zone,
dozones.zone as dropoff_zone,
tip_amount

from green_taxi_trips as taxi

inner join taxi_zone_lookup as puzones
on taxi.pulocationid=puzones.locationid

left join taxi_zone_lookup as dozones
on taxi.dolocationid=dozones.locationid

where puzones.zone like 'Astoria%%'
order by tip_amount desc
limit 1;
"""

pd.read_sql(query, con=engine)

  pickup_zone                   dropoff_zone  tip_amount
0     Astoria  Long Island City/Queens Plaza        88.0